``` Origin story of Pandas ``` :
1. in 2008 , the pandas development team was created by Wes McKinney and the other members of the Data Wrangling for Python (PyData) community.
2. The first version of pandas was released in 2009.

``` Pandas ``` : 
pandas is a Python library that is used for analyzing and manipulating data. It is known for its data structures and data analysis tools.

``` Use Cases ``` :
1. Data Cleaning
2. Data Analysis
3. Data Transformation
4. Data Visualization (Basic level)
5. Data Aggregation
6. File Handling
7. Data Filtering and Selection
8. Time Series Analysis

``` Series ```:
A series is a one dimensional labeled array that can hold any data type (integer, string, float, python objects, etc.). The axis labels are collectively called the index.

In [9]:
## multiple ways to create a Series.
import numpy as np
import pandas as pd

In [10]:
labels = ['a','b','c','d']
my_list = [10,20,30,40]
arr = np.array([10,20,30,40])
d = {'d':10,'b':20,'e':30,'d':40}

In [11]:
pd.Series(my_list)

0    10
1    20
2    30
3    40
dtype: int64

In [12]:
pd.Series(data=my_list,index=labels)

a    10
b    20
c    30
d    40
dtype: int64

In [13]:
pd.Series(arr)

0    10
1    20
2    30
3    40
dtype: int32

In [14]:
pd.Series(d)

d    40
b    20
e    30
dtype: int64

``` Data Frames ```:        
A DataFrame is a 2-dimensional labeled data structure with columns of potentially different types. It is similar to a spreadsheet or a database table, or a series of related arrays.

In [15]:
data = {
    "Name " : ["Ajay","Binod","Chotu","Dhruv"],
    "Age" : [28,34,29,42],
    "City" : ["Delhi","Mumbai","Pune","Chennai"],
    "Salary" : [61000,42000,30000,40000],
}

In [17]:
df=pd.DataFrame(data)
df

   Name   Age     City  Salary
0   Ajay   28    Delhi   61000
1  Binod   34   Mumbai   42000
2  Chotu   29     Pune   30000
3  Dhruv   42  Chennai   40000

In [19]:
data_list = [
    ['John', 28, 'New York', 65000],
    ['Anna', 34, 'Paris', 70000],
    ['Peter', 29, 'Berlin', 62000],
    ['Linda', 42, 'London', 85000]
]
df2 = pd.DataFrame(data_list)
df2

       0   1         2      3
0   John  28  New York  65000
1   Anna  34     Paris  70000
2  Peter  29    Berlin  62000
3  Linda  42    London  85000

In [20]:
columns = ['Name','Age','City','Salary']
df3 = pd.DataFrame(data_list,columns=columns)
df3

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [21]:
df3['Name']

0     John
1     Anna
2    Peter
3    Linda
Name: Name, dtype: object